export const CST = {
    SCENE: {
        LOADINGSCENE: "LoadingScene",
        LOBBYSCENE: "LobbyScene",
        GAMESCENE: "GameScene",
        GAMESCENE2: "GameScene2",
        GAMESCENE3: "GameScene3",
        GAMESCENE4: "GameScene4",
    }
}

export const socket = io();

export const LABEL_ID = {
    DOOR_FORWARD_ID: 11111111,
    DOOR_BACK_ID: 22222222,
    FIRST_KEY: 33333333,
    SECOND_KEY: 44444444,
    THIRD_KEY: 55555555,
    FOURTH_KEY: 6666666,
    FIVETH_KEY: 7777777,
    SIXETH_KEY: 8888888,
    SEIF_KEY: 9999999,
    EMPTY_KEY: 4555745
}

export const myMap = new Map([
    ['firstKey', { x: 250, text: 'I' }],
    ['secondKey', { x: 430, text: 'D' }],
    ['thirdKey', { x: 610, text: 'W' }],
    ['fourthKey', { x: 750, text: 'K' }],
    ['fivethKey', { x: 880, text: 'R' }],
    ['sixethKey', { x: 1000, text: 'P' }],

    // ['seif1', { x: 700, y: 400, text: 'Hi', img: 'later' }],
    // ['seif2', { x: 700, y: 400, text: 'Hu', img: 'memo' }],
    // ['seif3', { x: 700, y: 400, text: 'Dum', img: 'photo' }],

    ['seif1', { x: 490, y: 200, xi: 350, yi: 360, text: 'Фхугрлщг лк олърсжс зриерлнг\n\n“...еизя ахс ри тусфхс нгухлрг, г псл зугжсщиррюи\nесфтсплргрлв: есх пю фпиипфв рг кгрвхлвш е\nгнгзиплл, есх пиъхгип с фсдфхеиррюш еюфхгенгш,\nесх срг лкелрвихфв тиуизс прсм л цикйгих,\nугкдле фиузщи.Г есх в тсоцъгб рсесфхя с иё\nфпиухл ъиуик ъихюуи жсзг.Ефё жсулх е тгпвхл\nхгн вунс, дцзхс туслфшсзлос еъиуг, г ри прсжс оих\nргкгз…\nВ крго, ъхс иё угдсхю фхгрцх кргпирлхюпл! В\nфугкц цкрго ахсх фхлоя! Рлнхс нуспи пирв ри\nтсрлпгих ргфхсвьцб щиррсфхя нгухлрю! Срг\nзсойрг тулргзоийгхя при! Ахс излрфхеиррси,\nъхс ц пирв тсфои риё сфхгосфя...”', img: 'later' }],
    ['seif2', { x: 550, y: 180, xi: 370, yi: 360, text: 'Фхгугв пизлщлрфнгв фтугенг\n\n“Фсфхсврли тгщлирхг:  ъгфхюи лкпирирлв\nргфхусирлв, лптцояфлерюи уигнщлл,\nенобъгв рицпифхрюи йифхю л плплнц,\nфосйрсфхл е тсфхусирлл схрсыирлм ф\nзуцжлпл обзяпл, сзиуйлпсфхя сдэинхсп\nесйзиоирлв, тсхиув нсрхгнхг ф\nуигоярсфхяб.\n\nЗлгжрск: Тсжугрлърси угффхусмфхес\nолърсфхл, тусжуиффлуцбьлм флрзусп Гзиол.\n\nУинспирзгщлл: тсфиьирли хиугтиехг,\nсдвкгхиоярс тулпирирли грнфлсолхлнсе.\nХуидцих уижцовурсжс згояримыижс\nргдобзирлв.”', img: 'memo' }],
    ['seif3', { x: 730, y: 330, xi: 450, yi: 360, text: 'Нсооинщлв угколърюш\nчсхсжугчлм Пгмног', img: 'photo' }],
]);