export const CST = {
    SCENE: {
        LOADINGSCENE: "LoadingScene",
        LOBBYSCENE: "LobbyScene",
        GAMESCENE: "GameScene",
        GAMESCENE2: "GameScene2",
        GAMESCENE3: "GameScene3",
        GAMESCENE4: "GameScene4",
        GAMESCENE5: "GameScene5"
    }
}

export const socket = io();

export const LABEL_ID = {
    DOOR_FORWARD_ID: 11111111,
    DOOR_FORWARD2_ID: 11111112,
    DOOR_LEFT_ID: 111143444,
    DOOR_RIGHT_ID: 222143454,
    DOOR_BACK_ID: 22222222,

    DISK_KEY: 99999991,
    WINDOW_KEY: 99999993,
    CLOTHE_KEY: 999999994,
    KEYS_KEY: 999999995,
    NOTEBOOK_KEY: 999999996,
    BOTTLE_KEY: 999999997,
    PLAN_KEY: 999999998,
    CAMERA_KEY: 88888881,
    APPLICATION_KEY: 88888883,
    BAG_KEY: 888888884,
    NOTE_KEY: 88888886,
    COMPUTER_KEY: 88888887,
    PHONE_KEY: 88888888,

    PLACE_KEY_1: 333333333,
    PLACE_KEY_2: 333333337,
    PLACE_KEY_3: 333333332,
    PLACE_KEY_4: 333333338,
}

export const myMap = new Map([
    ['bag', { x: 655, y: 260, xi: 450, yi: 360, text: 'Ргмзирг йирфнгв фцпнг,\nерцхул зснцпирхю тс\nеюфхгени, тусфусъирргв\nтгънг хгдоихсн,\nфхгдлолклуцбьлш\nргфхусирли л\nвунс-нугфргв тспгзг.' }],
    ['bottle', { x: 648, y: 290, xi: 430, yi: 360, text: 'Ргмзир угкдлхюм\nчогнср. Тсзсдрюм чогнср\nсдюърс лфтсоякцихфв зов\nшугрирлв угфхесулхиов. ' }],
    ['camera', { x: 665, y: 280, xi: 430, yi: 360, text: 'Ргмзирг нгпиуг ф\nчсхсжугчлвпл\nцнугзиррюш анфтсргхсе\nлк зуцжлш пцкиие.' }],
    ['clothe', { x: 660, y: 290, xi: 430, yi: 360, text: 'Ргмзир нцфсн хнгрл сх\nфхгусм црлчсупю.' }],
    ['disk', { x: 680, y: 300, xi: 430, yi: 360, text: 'Ргмзирг фоспгрргв\nчоиынг. Рг нсутцфи\nргщгугтгрс: “Нгпиую\nелзисргдобзирлв”.' }],
    ['keys', { x: 670, y: 290, xi: 430, yi: 360, text: 'Ргмзирг февкнг\nзцдолнгхсе нобъим сх\nпцкив.' }],
    ['notebook', { x: 670, y: 250, xi: 430, yi: 360, text: 'Ргмзир зриерлн ф\nкгпихнгпл с\nпгхиулгогш зов\nуифхгугщлл рсесм\nнгухлрю. Лк доснрсхг\nеюуегрю рифнсоянс\nфхугрлщ.' }],
    ['plan', { x: 670, y: 290, xi: 430, yi: 360, text: 'Ргмзир тогр пцкив, жзи\nсхпиъирю тцхл сдшсзг\nнгпиу.' }],
    ['window', { x: 680, y: 290, xi: 430, yi: 360, text: 'Ргмзирг угпнг сх\nцнугзиррсм нгухлрю.' }],
    ['note', { x: 670, y: 270, xi: 430, yi: 360, text: 'Ргмзир зснцпирх с\nкгзсойрсфхл тс фъёхц\nрг лпв Гррю.\n\nЕрлкц ргзтлфя уцънсм:\n“Жзи йи еквхя зиряжл?”' }],
    ['computer', { x: 670, y: 240, xi: 430, yi: 360, text: 'Рсцхдцн. Схнуюх\nзснцпирх ф кгтлфвпл с\nтиуизелйирлвш\nугдсхрлнсе пцкив л\nкгпихнгш с тусыоюш\nнугйгш. Рг нуюыни\nрсцхдцнг ргноимнл е\nелзи дцнею “П”' }],
    ['phone', { x: 680, y: 230, xi: 430, yi: 360, text: 'Рг анугри псдлоярсжс\nхиоичсрг ешсзвьии\nфссдьирли:\n\n”Хсоянс тстусдцм\nстскзгхя рг ефхуиъц!\nЗгегм шсхв дю\nугкеизипфв тс\nрсупгоярспц!”' }],
    ['application', { x: 690, y: 290, xi: 430, yi: 360, text: 'Фпвхси кгвеоирли рг\nцесоярирли сх Г.' }],

    ['door1', { x: 500, text: 'Екжовз рг Есфхсн.' }],
    ['door2', { x: 510, text: 'Екжовз рг Фиеиу.' }],
    ['door3', { x: 540, text: 'Екжовз рг Бж.' }],
    ['door4', { x: 510, text: 'Екжовз рг Кгтгз.' }],
]);